app/controllers/corrections_controller.rb

SELECT "corrections".* FROM "corrections"
---
  def index
    @corrections = Correction.all

SELECT "corrections".* FROM "corrections" WHERE "corrections"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @correction = Correction.find(params[:id])

INSERT INTO "corrections" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sat, 27 Apr 2013 05:56:44 UTC +00:00], ["updated_at", Sat, 27 Apr 2013 05:56:44 UTC +00:00]]
---
  def create
    @correction = Correction.new(params[:correction])

    respond_to do |format|
      if @correction.save