app/controllers/exercices_controller.rb

  def index
    @exercices = Exercice.all
---
SELECT "exercices".* FROM "exercices"

  def show
    @exercice = Exercice.find(params[:id])
---
SELECT "exercices".* FROM "exercices" WHERE "exercices"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @exercice = Exercice.find(params[:id])
---
SELECT "exercices".* FROM "exercices" WHERE "exercices"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @exercice = Exercice.new(params[:exercice])

    respond_to do |format|
      if @exercice.save
---
INSERT INTO "exercices" ("bac", "contenu", "created_at", "millesime", "theme", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["bac", true], ["contenu", "zert"], ["created_at", Sat, 27 Apr 2013 05:47:22 UTC +00:00], ["millesime", 2012], ["theme", "zerr"], ["updated_at", Sat, 27 Apr 2013 05:47:22 UTC +00:00]]

  def update
    @exercice = Exercice.find(params[:id])
---
SELECT "exercices".* FROM "exercices" WHERE "exercices"."id" = ? LIMIT 1  [["id", "1"]]