app/controllers/statiques_controller.rb

  def show
    @statique = Statique.find(params[:id])
---
SELECT "statiques".* FROM "statiques" WHERE "statiques"."id" = ? LIMIT 1  [["id", "1"]]